Repository: Softcatala/translation-memory-tools
Catalog: latest-memories/tmx/drupal-tm.tmx
Source language: en
Languages: ca_es

source: The Path module provides a way to search and view a <a href="@aliases">list of all aliases</a> that are in use on your website. Aliases can be added, edited and deleted through this list.
ca_es: El mòdul Path proporciona una forma de cercar i consultar una <a href="@aliases">llista de tots els àlies</a> que s'utilitzen en un lloc web. Els àlies es poden afegir, editar o suprimir a través d'aquesta llista.

source: An alias defines a different name for an existing URL path - for example, the alias 'about' for the URL path 'node/1'. A URL path can have multiple aliases.
ca_es: Un àlies defineix un nom diferent per una URL existent - per exemple, l'àlies 'about' per la URL 'node/1'. Una URL pot tenir múltiples àlies.

source: Administer URL aliases
ca_es: Administra els àlies URL

source: Create and edit URL aliases
ca_es: Crea i edita els àlies URL

source: The alias is already in use.
ca_es: Ja s'està utilitzant l'àlies.

source: Optionally specify an alternative URL by which this term can be accessed. Use a relative path and don't add a trailing slash or the URL alias won't work.
ca_es: Opcionalment, especifiqueu una URL alternativa per la qual es pot accedir a aquest terme. Utilitzeu un camí relatiu i no afegiu la barra final o l'àlies URL no funcionarà.

source: The PHP filter module adds a PHP filter to your site, for use with <a href="@filter">text formats</a>. This filter adds the ability to execute PHP code in any text field that uses a text format (such as the body of a node or the text of a comment). <a href="@php-net">PHP</a> is a general-purpose scripting language widely-used for web development, and is the language with which Drupal has been developed. For more information, see the online handbook entry for the <a href="@php">PHP filter module</a>.
ca_es: El mòdul PHP filter afegeix un filtre PHP al vostre lloc, per a utilitzar-lo amb els <a href="@filter">formats de text</a>. Aquest filtre afegeix la possibilitat d'executar codi PHP a qualsevol camp de text que utilitzi un format de text (tals com el cos d'un node o el text d'un comentari). El <a href="@php-net">PHP</a> és un llenguatge d'script de caràcter general àmpliament utilitzat en el desenvolupament web, i és també el llenguatge amb que s'ha desenvolupat el Drupal. Per a més informació, aneu a la secció del <a href="@php">mòdul PHP filter</a> del manual en línia.

source: Enabling execution of PHP in text fields
ca_es: Habilitació de l'execució de PHP en els camps de text

source: The PHP filter module allows users with the proper permissions to include custom PHP code that will get executed when pages of your site are processed. While this is a powerful and flexible feature if used by a trusted user with PHP experience, it is a significant and dangerous security risk in the hands of a malicious or inexperienced user. Even a trusted user may accidentally compromise the site by entering malformed or incorrect PHP code. Only the most trusted users should be granted permission to use the PHP filter, and all PHP code added through the PHP filter should be carefully examined before use. <a href="@php-snippets">Example PHP snippets</a> can be found on Drupal.org.
ca_es: El mòdul PHP filter permet als usuaris amb els permisos adequats incloure codi PHP personalitzat que s'executarà quan es processin les pàgines del vostre lloc. Tot i que aquesta és una opció potent i flexible si és utilitzada per un usuari de confiança amb experiència amb PHP, és un risc important de seguretat en mans d'un usuari maliciós o sense experiència. Fins i tot un usuari de confiança pot comprometre accidentalment el lloc pel fet d'introduir codi PHP incorrecte o malformat. Només els usuaris de més confiança haurien de tenir permisos per utilitzar el filtre PHP, i tot el codi afegit mitjançant el filtre PHP hauria d'examinar-se acuradament abans d'utilitzar-lo. Podeu trobar alguns <a href="@php-snippets">exemples de codi PHP</a> a Drupal.org.

source: Use PHP for settings
ca_es: Utilitza PHP per a la parametrització

source: <p>Add a custom block to your site, named "Welcome" . With its text format set to "PHP code" (or another format supporting PHP input), add the following in the Block body:</p> <pre> print t('Welcome visitor! Thank you for visiting.'); </pre>
ca_es: <p>Afegiu un bloc personalitzat al vostre lloc, anomenat "Benvingut/da". Establiu el seu format de text com a "PHP Code" (o cap altre format que suporti l'entrada de PHP), i afegiu el següent com a cos del bloc:</p> <pre> print t('Benvingut visitant! Gràcies per visitar-nos.'); </pre>

source: <p>To display the name of a registered user, use this instead:</p> <pre> global $user; if ($user->uid) { print t('Welcome @name! Thank you for visiting.', array('@name' => format_username($user))); } else { print t('Welcome visitor! Thank you for visiting.'); } </pre>
ca_es: <p>Per mostrar el nom d'un usuari registrat, utlitzeu el següent, en canvi:</p> <pre> global $user; if ($user->uid) { print t('Benvingut, @name! Gràcies per visitar-nos.', array('@name' => format_username($user))); } else { print t('Benvolgut visitant! Gràcies per visitar-nos.'); } </pre>

source: A !php-code text format has been created.
ca_es: S'ha creat un format de text de !php-code.

source: The PHP module has been disabled. Any existing content that was using the PHP filter will now be visible in plain text. This might pose a security risk by exposing sensitive information, if any, used in the PHP code.
ca_es: S'ha inhabilitat el mòdul PHP. Qualsevol contingut existent que utilitzava el filtre PHP ara serà visible com a text net. Això pot representar un risc de seguretat en exposar informació confidencial, si n'hi ha, utilitzada en el codi PHP.

source: The Poll module can be used to create simple surveys or questionnaires that display cumulative results. A poll is a good way to receive feedback from site users and community members. For more information, see the online handbook entry for the <a href="@poll">Poll module</a>.
ca_es: El mòdul Poll es pot utilitzar per crear enquestes o qüestionaris senzills que mostrin resultats acumulats. Una enquesta és una bona forma de rebre feedback dels usuaris del lloc i dels membres de la comunitat. Per a més informació, aneu a la secció del <a href="@poll">mòdul Poll</a> del manual en línia.

source: Creating a poll
ca_es: Creació d'una enquesta

source: Users can create a poll by clicking on Poll on the <a href="@add-content">Add new content</a> page, and entering the question being posed, the answer choices, and beginning vote counts for each choice. The status (closed or active) and duration (length of time the poll remains active for new votes) can also be specified.
ca_es: Els usuaris poden crear una enquesta fent clic a Enquesta a la pàgina <a href="@add-content">Afegeix un nou contingut</a>, i introduint la pregunta plantejada, les opcions de resposta i els vots inicials de cada opció. També es pot especificar l'estat (tancat o actiu) i la durada (temps que l'enquesta es manté activa per a nous vots).

source: Viewing polls
ca_es: Consulta d'enquestes

source: You can visit the <a href="@poll">Polls</a> page to view all current polls, or alternately enable the <em>Most recent poll</em> block on the <a href="@blocks">Blocks administration page</a>. To vote in or view the results of a specific poll, you can click on the poll itself.
ca_es: Podeu visitar la pàgina d'<a href="@poll">Enquestes</a> per a veure totes les enquestes actuals, o alternativament, habilitar el bloc <em>Enquesta més recent</em> a la <a href="@blocks">pàgina d'administració de blocs</a>. Per a votar o veure els resultats d'una enquesta determinada, podeu fer clic a l'enquesta en si.

source: Vote on polls
ca_es: Vota a les enquestes

source: Cancel and change own votes
ca_es: Cancel·la i canvia els vots propis

source: View voting results
ca_es: Accedeix als resultats de les votacions

source: Your vote was cancelled.
ca_es: S'ha cancel·lat el vostre vot.

source: To enable browsing this field by value, enter a title for the resulting page. The word <code>%value</code> will be substituted with the corresponding value. An example page title is "People whose favorite color is %value" . This is only applicable for a public field.
ca_es: Per activar la navegació d'aquest camp per valor, introduïu un títol per a la pàgina resultant. La paraula <code>%value</code> se substituirà pel valor corresponent. Un títol de pàgina d'exemple és "Persones que el seu color favorit és %value". Això només s'aplica per a un camp públic.

source: To enable browsing this field by value, enter a title for the resulting page. An example page title is "People who are employed" . This is only applicable for a public field.
ca_es: Per permetre la navegació d'aquest camp per valor, introduïu un títol per a la pàgina resultant. Un títol de pàgina d'exemple és "Gent contractada". Això només s'aplica per a un camp públic.

source: The Profile module allows site administrators to define custom fields (such as country, full name, or age) for user profiles, which are then displayed in the <a href="@user">My Account</a> section. This permits users of a site to share more information about themselves, and can help community-based sites organize users around specific information. For more information, see the online handbook entry for <a href="@profile">Profile module</a>.
ca_es: El mòdul Profile permet als administradors del lloc definir camps personalitzats (com el país, el nom complet o l'edat) per als perfils d'usuari, que es mostra a la secció <a href="@user">El meu compte</a>. Això permet que els usuaris d'un lloc comparteixin més informació sobre ells mateixos i pot ajudar als llocs que es basen en una comunitat a organitzar els usuaris al voltant d'una informació determinada. Per a més informació, aneu a la secció del <a href="@profile">mòdul Profile</a> del manual en línia.

source: Adding fields to the default profile
ca_es: Afegir camps al perfil predeterminat

source: To provide the ability for users to enter more information about themselves, the Profile module allows additional fields to be added to the default user profile. Examples of common additions would be <em>Location</em>, <em>Company</em>, <em>Age</em>, or <em>About me</em>.
ca_es: Per tal de proporcionar la capacitat als usuaris d'introduir més informació sobre ells mateixos, el mòdul Profile permet afegir camps addicionals al perfil d'usuari predeterminat. Exemples d'addicions comunes serien <em>Localització</em>, <em>Empresa</em>, <em>Edat</em> o <em>Sobre mi</em>.

source: User information pages
ca_es: Pàgines d'informació d'usuari

source: The Profile module enables links to see further information about site users. You can view both a main <a href="@profile">User list page</a>, and more specified pages by clicking on linked fields in any profile. For example, the <a href="@profile-country">People who live in Canada</a> listing on Drupal.org displays all users who have entered <em>Canada</em> in the <em>Country</em> field on their user profile.
ca_es: El mòdul Profile habilita enllaços per a veure més informació sobre els usuaris del lloc. Podeu veure una pàgina amb una <a href="@profile">llista d'usuaris</a> i pàgines més específiques fent clic als camps enllaçats de qualsevol perfil. Per exemple, el llistat de la <a href="@profile-country">gent que viu al Canadà</a> a Drupal.org mostra tots els usuaris que han introduït <em>Canadà</em> al camp <em>País</em> del seu perfil d'usuari.

source: Author information block
ca_es: Bloc d'informació de l'autor

source: The <em>Author information block</em> is a default block created by the Profile module that can be enabled on the <a href="@blocks">Blocks administration page</a>. It shows visitors of your website information about the author of the page they are reading.
ca_es: El <em>bloc Informació de l'autor</em> és un bloc creat per defecte pel mòdul Profile que pot ser habilitat a la <a href="@blocks">pàgina d'Administració de blocs</a>. Mostra als visitants del vostre lloc informació sobre l'autor de la pàgina que estan llegint.

source: This page displays a list of the existing custom profile fields to be displayed on a user's <em>My account</em> page. To provide structure, similar or related fields may be placed inside a category. To add a new category (or edit an existing one), edit a profile field and provide a new category name.
ca_es: Aquesta pàgina mostra una llista dels camps personalitzats existents del perfil per mostrar en la pàgina d'usuari <em>El meu compte</em>. Per donar-li estructura, els camps similars o relacionats poden estar situats dins d'una categoria. Per afegir una nova categoria (o editar-ne una d'existent), editeu un camp de perfil i doneu-li el nom de la nova categoria.

source: The RDF module enriches your content with metadata to let other applications (e.g. search engines, aggregators) better understand its relationships and attributes. This semantically enriched, machine-readable RDF output for Drupal sites uses the <a href="@rdfa">RDFa specification</a>. Other modules can define mappings of their data to RDFa properties, and the RDF module makes the data available to the theme. The core Drupal modules define RDF mappings for their information, and the core Drupal themes output the RDF meta-data information along with the human-readable visual information. For more information, see the online handbook entry for <a href="@rdf">RDF module</a>.
ca_es: El mòdul RDF enriqueix el vostre contingut amb metadades que permeten a d'altres aplicacions (p.e. cercadors, agregadors) entendre millor les seves relacions i atributs. Aquesta sortida RDF semànticament rica, llegible-per-la-màquina per a llocs fets en Drupal utilitza l'<a href="@rdfa">especificació RDFa</a>. Altres mòduls poden definir correspondències entre les seves dades i propietats RDFa, i el mòdul RDF posa les dades a disposició dels temes. Els mòduls del nucli del Drupal defineixen correspondències RDF per a la seva informació, i els temes del nucli del Drupal mostren la informació de metadades d'RDF juntament amb la informació visual llegible-pels-humans. Per a més informació, aneu a la secció del <a href="@rdf">mòdul RDF</a> del manual en línia.

source: Enriches your content with metadata to let other applications (e.g. search engines, aggregators) better understand its relationships and attributes.
ca_es: Enriqueix el vostre contingut amb metadades per tal que d'altres aplicacions (p.ex. cercadors, agregadors) entenguin millor les seves relacions i atributs.

source: Active search modules
ca_es: Mòduls de cerca actius

source: Determine which search modules are active from the available modules.
ca_es: Determineu dels mòduls disponibles quins mòduls de cerca són actius.

source: The active search modules have been changed.
ca_es: Han canviat els mòduls de cerca actius.

source: You must include at least one positive keyword with 1 character or more.
ca_es: Heu d'incloure almenys una paraula clau positiva amb 1 caràcter o més.

source: Searched %type for %keys.
ca_es: Cercat %type per %keys.

source: The Search module provides the ability to index and search for content by exact keywords, and for users by username or e-mail. For more information, see the online handbook entry for <a href="@search-module">Search module</a>.
ca_es: El mòdul Search proporciona la capacitat d'indexar i cercar contingut per paraules clau exactes, i usuaris pel seu nom d'usuari o correu electrònic. Per a més informació, aneu a la secció del <a href="@search-module">mòdul Search</a> del manual en línia.

source: Searching content and users
ca_es: Cerca de contingut i d'usuaris

source: Users with <em>Use search</em> permission can use the search block and <a href="@search">Search page</a>. Users with the <em>View published content</em> permission can search for content containing exact keywords. Users with the <em>View user profiles</em> permission can search for users containing the keyword anywhere in the user name, and users with the <em>Administer users</em> permission can search for users by email address. Additionally, users with <em>Use advanced search</em> permission can find content using more complex search methods and filtering by choosing the <em>Advanced search</em> option on the <a href="@search">Search page</a>.
ca_es: Els usuaris amb el permís <em>Utilitza la cerca</em> poden utilitzar el bloc i la <a href="@search">pàgina de Cerca</a>. Els usuaris amb el permís <em>Accedeix al contingut publicat</em> poden cercar contingut que contingui les paraules clau exactes. Els usuaris amb el permís <em>Accedeix als perfils dels usuaris</em> poden cercar usuaris que continguin les paraules clau a qualsevol lloc del nom d'usuari, i els usuaris amb el permís <em>Administra els usuaris</em> poden cercar usuaris per la seva adreça de correu electrònic. A més a més, els usuaris amb el permís <em>Utilitza la cerca avançada</em> poden buscar contingut utilitzant mètodes de cerca més complexes i filtrar escollint l'opció <em>Cerca avançada</em> a la <a href="@search">pàgina de Cerca</a>.

source: Indexing content with cron
ca_es: Indexació del contingut amb el cron

source: To provide keyword searching, the search engine maintains an index of words found in the content. To build and maintain this index, a correctly configured <a href="@cron">cron maintenance task</a> is required. Users with <em>Administer search</em> permission can further configure the cron settings on the <a href="@searchsettings">Search settings page</a>.
ca_es: Per proporcionar la cerca per paraules clau, el motor de cerca manté un índex de les paraules trobades al contingut. Per tal de construir i mantenir aquest índex, fa falta tenir correctament configurada una <a href="@cron">tasca de manteniment cron</a>. Els usuaris amb el permís <em>Administra la cerca</em> poden configurar els paràmetres del cron a la <a href="@searchsettings">pàgina de Paràmetres de cerca</a>.

source: Configuring search settings
ca_es: Configuració dels paràmetres de cerca

source: Indexing behavior can be adjusted using the <a href="@searchsettings">Search settings page</a>. Users with <em>Administer search</em> permission can control settings such as the <em>Number of items to index per cron run</em>, <em>Indexing settings</em> (word length), <em>Active search modules</em>, and <em>Content ranking</em>, which lets you adjust the priority in which indexed content is returned in results.
ca_es: El comportament de la indexació es pot ajustar utilitzant la <a href="@searchsettings">pàgina de Paràmetres de cerca</a>. Els usuaris amb el permís <em>Administra la cerca</em> poden controlar paràmetres com el <em>Nombre d'elements a indexar en cada execució del cron</em>, <em>Paràmetres de la indexació</em> (mida de la paraula), <em>Mòduls de cerca actius</em> i <em>Rànquing de contingut</em>, el qual permet ajustar la prioritat amb que es retorna el contingut indexat dins dels resultats.

source: The Search module includes a default <em>Search form</em> block, which can be enabled and configured on the <a href="@blocks">Blocks administration page</a>. The block is available to users with the <em>Search content</em> permission.
ca_es: El mòdul Search inclou de forma predeterminada un bloc de <em>Formulari de cerca</em>, el qual es pot habilitar i configurar a la <a href="@blocks">pàgina d'administració de Blocs</a>. El bloc està disponible per als usuaris amb el permís <em>Cerca al contingut</em>.

source: Extending Search module
ca_es: Ampliació del mòdul Search

source: By default, the Search module only supports exact keyword matching in content searches. You can modify this behavior by installing a language-specific stemming module for your language (such as <a href="http://drupal.org/project/porterstemmer">Porter Stemmer</a> for American English), which allows words such as walk, walking, and walked to be matched in the Search module. Another approach is to use a third-party search technology with stemming or partial word matching features built in, such as <a href="http://drupal.org/project/apachesolr">Apache Solr</a> or <a href="http://drupal.org/project/sphinx">Sphinx</a>. These and other <a href="@contrib-search">search-related contributed modules</a> can be downloaded by visiting Drupal.org.
ca_es: Per defecte, el mòdul Search només permet la coincidència exacta de paraules clau a les cerques de contingut. Podeu modificar aquest comportament instal·lant un mòdul de derivació de llengua per a la vostra llengua (com <a href="http://drupal.org/project/porterstemmer">Porter Stemmer</a> per a l'Anglès Americà), el qual permet que el mòdul Search emparelli paraules com walk, walking i walked. Un altre enfocament és utilitzar una tecnologia de cerca de tercers amb característiques integrades de concordança de paraula derivades o parcials, com <a href="http://drupal.org/project/apachesolr">Apache Solr</a> o <a href="http://drupal.org/project/sphinx">Sphinx</a>. Aquests i d'altres <a href="@contrib-search">mòduls contribuïts relacionats amb la cerca</a> es poden descarregar de Drupal.org.

source: <ul> <li>Check if your spelling is correct.</li> <li>Remove quotes around phrases to search for each word individually. <em>bike shed</em> will often show more results than <em>&quot;bike shed&quot;</em>.</li> <li>Consider loosening your query with <em>OR</em>. <em>bike OR shed</em> will often show more results than <em>bike shed</em>.</li> </ul>
ca_es: <ul> <li>Comproveu si l'ortografia és correcta.</li><li>Elimineu les cometes al voltant de frases per a buscar cada paraula individualment. <em>cobert bicicleta</em> sovint mostrarà més resultats que no pas <em>&quot;cobert bicicleta&quot;</em>.</li> <li>Considereu relaxar a vostra consulta amb <em>OR</em>. <em>cobert OR bicicleta</em> sovint mostrarà més resultats que ni pas <em>cobert bicicleta</em>.</li> </ul>

source: Administer search
ca_es: Administra la cerca

source: Use search
ca_es: Utilitza la cerca

source: Use advanced search
ca_es: Utilitza la cerca avançada

source: Configure relevance settings for search and other indexing options.
ca_es: Configureu els paràmetres rellevants per a la cerca i d'altres opcions d'indexació.

source: Choose a set of shortcuts to use
ca_es: Escolliu un conjunt d'accessos directes a utilitzar

source: Choose a set of shortcuts for this user
ca_es: Escolliu un conjunt d'accessos directes per aquest usuari

source: The new set is created by copying items from the @default set.
ca_es: El nou conjunt es crea a partir d'una còpia dels elements del conjunt @default.

source: You are now using the new %set_name shortcut set. You can edit it from this page or <a href="@switch-url">switch back to a different one.</a>
ca_es: Esteu utilitzant el nou conjunt d'accessos directes %set_name. Podeu editar-lo des d'aquesta pàgina o <a href="@switch-url">canviar a un altre diferent</a>.

source: %user is now using a new shortcut set called %set_name. You can edit it from this page.
ca_es: %user utilitza a partir d'ara un nou conjunt d'accessos directes anomenat %set_name. El podeu editar des d'aquesta pàgina.

source: You are now using the %set_name shortcut set.
ca_es: Esteu utilitzant el conjunt d'accessos directes %set_name.

source: %user is now using the %set_name shortcut set.
ca_es: %user utilitza a partir d'ara el conjunt d'accessos directes %set_name.

source: Using set "@set"
ca_es: S'està utilitzant el conjunt "@set"

source: Change set
ca_es: Canvia el conjunt

source: The shortcut set has been updated.
ca_es: S'ha actualitzat el conjunt d'accessos directes.

source: Add new shortcut
ca_es: Afegeix un nou accés directe

source: Editing @shortcut
ca_es: Editant @shortcut

source: The name of the shortcut.
ca_es: El nom de l'accés directe.
